/*
 *  Localizable.string (English)
 *  TI Gas Sensor App
 *  05/05/13
 *
 *  Copyright (c) 2013 Texas Instruments. All rights reserved.
 *  Created under contract for TI by Krasamo LLC (info@krasamo.com).
 *
 */

/* Dashboard or Main Screen */
"Dashboard.title"  = "Dashboard";
"Graph.title"  = "Graph";
"Connect.title"  = "Connect";
"Settings.title"  = "Settings";
"Info.title" = "Info";
"Share.title" = "Share";
"MainScreen.title" = "MainScreen";

/* Sensor Info Screen */
"SensorInfo.SensorName.Label" = "Name:";
"SensorInfo.SensorType.Label" = "Type:";
"SensorInfo.SensorAddress.Label" = "Address:";

"SensorInfo.Calibrate.button" = "Calibrate";
"SensorInfo.ReCalibrate.button" = "Re-Calibrate";
"SensorInfo.Calibrating.button" = "Calibrating";
"SensorInfo.NoSensorConnected.Label" = "None";

"SensorInfo.Units.MicroSeconds.Short" = "ms";
"SensorInfo.Units.Seconds.Short" = "s";
"SensorInfo.Units.Degrees.Celcius.Short" = "°C";
"SensorInfo.Units.Volts.Short" = "V";

"SensorInfo.TextView" = "Please allow 10 min for the electro-chemical sensor to reach its nominal operating state after being turned on.";

/* Graph Screen */
"GraphScreen.Title.Placeholder" = "Title NA";
"GraphScreen.SubTitle.Placeholder" = "SubTitle NA";
"GraphScreen.ScatterPlot.Title" = "TI Gas Sensor Real Time Plot";

/* Connect Screen */
"ConnectScreen.ConnectedSensor.Header" = "Connected To Sensor";
"ConnectScreen.DiscoveredSensors.Header" = "Discovered Sensors";

"ConnectScreen.SensorName.Alert.Title" = "Save Sensor Name";
"ConnectScreen.SensorName.Alert.Body" = "Please enter a sensor name";
"ConnectScreen.SensorName.Placeholder" = "Sensor name";
"ConnectScreen.SensorName.Default" = "TI Gas Sensor";
"ConnectScreen.NoSensorAvailable.Message" = "No Sensor Available";

/* Settings */

"Settings.Input.NotAvailable.String" = "Not Initialized";
"Settings.Input.NotAvailable.Number" = "NA";
"Settings.Input.DoNotScale.String" = "No Scaling";
"Settings.Input.DoNotCalibrate.String" = "No Calibration";

"Settings.SaveSettings.Alert.EnterSettingName" = "Enter A Setting Name.";
"Settings.SaveSettings.Alert.SaveSetting.Button" = "Save Setting";
"Settings.SaveSettings.Label" = "Save Settings";
"Settings.SaveSettings.SettingName.Placeholder" = "Setting Name";

"Settings.Alert.InputMustBeNonZeroValue" = "Field must be a non-zero numeric value.";
"Settings.Alert.InputMustBeUnsignedInteger" = "Field must be an unsigned integer value.";
"Settings.Alert.InputMustBeFloat" = "Field must be a numeric float value.";
"Settings.Alert.CanNotEnableLogScale" = "Disabling logarithmic scale since there may be negative y-axis values or very large values.";
"Settings.Alert.CanNotEnableLogScale.Title" = "Log Scale Not Enabled";

"Settings.ViewAndConfigure.Header" = "View And Configure Current Settings";
"Settings.SelectToLoad.Header" = "Saved Settings: Select To Load";

"Settings.FormulaSettings.title" = "Formula Settings";
"Settings.GraphSettings.title" = "Graph Settings";
"Settings.SensorSettings.title" = "Sensor Settings";

"Settings.Graph.Title.Label" = "Graph Title";
"Settings.Graph.SubTitle.Label" = "Graph Sub-Title";
"Settings.Graph.Y_Axis.Caption.Label" = "Y Axis Caption";
"Settings.Graph.X_Axis.Caption.Label" = "X Axis Caption";
"Settings.Graph.Enable.Logarithmic.Scale" = "Use Logarithmic Scale";
"Settings.Graph.Value.Mid_Low.Band" = "Value Mid-Low Band";
"Settings.Graph.Value.Top_Mid.Band" = "Value Top-Mid Band";
"Settings.Graph.Y_Axis.Display.Minimum" = "Y Axis Display Minimum";
"Settings.Graph.Y_Axis.Display.Maximum" = "Y Axis Display Maximum";
"Settings.Graph.Color.Lower.Band" = "Color Lower Band";
"Settings.Graph.Color.Middle.Band" = "Color Middle Band";
"Settings.Graph.Color.Top.Band" = "Color Top Band";
"Settings.Graph.Sensor.Calibration.Value" = "Sensor Calibration Value";
"Settings.Graph.Show.Current.Value" = "Show Current Value";

"Settings.Formula.DisplayFormula.Header" = "Sensor Formula:";
"Settings.Formula.X0" = "X₀";
"Settings.Formula.D0" = "D₀";
"Settings.Formula.D1" = "D₁";
"Settings.Formula.N0" = "N₀";
"Settings.Formula.ScaleFactor.Num" = "Scale Factor Num";
"Settings.Formula.ScaleFactor.Denom" = "Scale Factor Denom";

/* Info Screen */
"InfoScreen.Analog" = "Analog";
"InfoScreen.Power" = "Power";
"InfoScreen.BLE" = "Processing";
"InfoScreen.TISolutions" = "TI Solutions";
"InfoScreen.Krasamo.Header" = "Powered by Krasamo LLC";

"InfoScreen.Copyrights" = "(c) 2013 by Texas Instruments Inc. All rights reserved.\n\nOpen Source Projects used in this App:\n\nCore Plot (\"BSD New\" or \"BSD Simplified\")\nhttp://opensource.org/licenses/BSD-3-Clause\n\nNeovera Color Picker [Apache License 2.0]\n(http://www.apache.org/licenses/LICENSE-2.0.html)\n";

"InfoScreen.About" = "Texas Instruments develops analog, digital signal processing, RF and DLP semiconductor technologies that help customers deliver consumer and industrial electronics products with greater performance, increased power efficiency, higher precision, more mobility and better quality.\n\nGet full information at TI.com\n\nPrivacy Policy\n\nTexas Instruments Mobile Applications Privacy Policy can be found at http://www.ti.com/corp/docs/legal/privacy.shtml\nVersion 2.0\n\n(c) 2013 by Texas Instruments Inc. All rights reserved\n";

"InfoScreen.Refresh" = "Refresh";
"InfoScreen.Stop" = "Stop";
"InfoScreen.NoConnection" = "The Internet connection appears to be offline.";

/* No Sensor Available Screen */
"NoSensorAvailableScreen.message.one" = "This app works when connected to a TI Gas Sensor using the LMP91000.";
"NoSensorAvailableScreen.message.two" = "Make sure to turn the sensor on.";
"NoSensorAvailableScreen.ConnectNearby.message" = "Connect to a sensor nearby";
"NoSensorAvailableScreen.PurchaseSensor.message" = "Purchase a TI Gas Sensor";
"NoSensorAvailableScreen.NotConnected.Header" = "Not Connected";

/* Generic Buttons */
"Button.Save" = "Save";
"Button.Cancel" = "Cancel";

/* Color Picker */
"ColorPicker.SelectedColor.Label" = "Selected Color";

/* Alerts */
"Alert.OK" = "OK";
"Alert.BT.TurnedOff" = "Please turn on Bluetooth in Settings app to allow \"TI Gas Sensor\" to connect to accessories";
"Alert.BT.CanNotScan" = "App can not scan for peripherals. Please turn on Bluetooth in Settings app.";
"Alert.BT.NotAvailable" = "This device doesn't support Bluetooth Low Energy.";
"Alert.BT.AppNotAuthorized" = "This app is not authorized to use Bluetooth Low Energy.";
"Alert.BT.UnknownError" = "Bluetooth Unknown Error.";
"Alert.BT.ConnectionTimeout" = "The connection to the sensor has timeout. Please try to re-connect by turning off / on the sensor and re-scanning.";
"Alert.BT.CanNotWriteValue" = "There was an error while tring to write the characteristic value to the sensor.";

/* Sharing or Email */
"Email.SensorName.Label" = "Sensor Name:";
"Email.SensorType.Label" = "Sensor Type:";
"Email.Subject" = "TI Gas Sensor App Graph Data";
"Email.Attachment.FileName" = "Graph";
"Email.Body.Timestamp" = "Timestamp: ";

"Sharing.EmailSent.Message" = "Sending Email";
"Sharing.CopyToClipboard.Message" = "Copying To Clipboard";
"Sharing.Print.Message" = "Printing";
"Sharing.Done.Message" = "Done";

/* Loading */
"Loading.PleaseWait.Label" = "Please wait";
"Loading.Reading.Label" = "Reading characteristics from TI Gas Sensor, in order to begin receiving samples.";
